
--advertisements 

INSERT INTO "Advertisements" (header, description, price, category, author, "publicationDate", "countWatch", "status", "editDate")
VALUES
('Новогодние подарки ручной работы', 'Уникальные подарки для ваших близких. Под заказ!', 500, 5, 6, '2023-12-26', 0, 2, '2023-12-26'),
('Летний отдых на море', 'Сдам домик у моря на лето. Все удобства, тихое место.', 15000, 5, 2, '2023-12-26', 0, 2, '2023-12-26'),
('Велосипед Scott', 'Продам велосипед в отличном состоянии. Идеальный выбор для активного отдыха!', 7000, 1, 8, '2023-12-27', 0, 2, '2023-12-27'),
('Студийная квартира в центре', 'Сдам стильную квартиру в центре города. Все необходимое для комфортного проживания.', 20000, 5, 7, '2023-12-27', 0, 2, '2023-12-27'),
('Фотоаппарат Canon EOS 5D Mark IV', 'Продаю профессиональный фотоаппарат в идеальном состоянии. Отличный выбор для фотолюбителей и профессионалов.', 30000, 3, 9, '2023-12-27', 0, 2, '2023-12-27'),
('Учебные пособия по программированию', 'Продаю книги и пособия для изучения различных языков программирования. Идеально для студентов и начинающих разработчиков.', 1000, 1, 10, '2023-12-28', 0, 2, '2023-12-28'),
('Коллекционные монеты', 'Продаю уникальные коллекционные монеты различных стран и эпох. В отличном состоянии.', 5000, 5, 11, '2023-12-28', 0, 2, '2023-12-28'),
('Семейный автомобиль Honda CR-V', 'Продаю семейный автомобиль в идеальном состоянии. Обслуживание у официального дилера.', 25000, 5, 12, '2023-12-28', 0, 2, '2023-12-28'),
('Квадрокоптер DJI Mavic Air 2', 'Продаю беспилотник с продвинутыми функциями и отличным качеством съемки. Идеальное решение для любителей и профессионалов.', 15000, 3, 13, '2023-12-29', 0, 2, '2023-12-29'),
('Раритетная гитара Fender Stratocaster', 'Продаю коллекционную гитару Fender Stratocaster. Отличный звук и стильный дизайн.', 12000, 5, 14, '2023-12-29', 0, 2, '2023-12-29');

INSERT INTO "Advertisements" (header, description, price, category, author, "publicationDate", "countWatch", "status", "editDate") VALUES
('Учебные пособия по математике', 'Продаю набор учебных пособий по математике для школьников и студентов. Идеальный выбор для обучения.', 1500, 1, 1, '2023-12-24', 0, 2, '2023-12-24'),
('Холодильник LG', 'Продаю холодильник LG в идеальном состоянии. Объем 300 литров. Отличное решение для кухни.', 10000, 2, 2, '2023-12-24', 0, 2, '2023-12-24'),
('Смартфон iPhone 13', 'Продаю новый смартфон iPhone 13. Премиальный дизайн и высокие технические характеристики.', 30000, 3, 3, '2023-12-24', 0, 2, '2023-12-24'),
('Репетитор по английскому', 'Провожу занятия по английскому языку для школьников и студентов. Индивидуальный подход и результат гарантирован.', 2000, 4, 4, '2023-12-24', 0, 2, '2023-12-24'),
('Продаю старинное кресло', 'Продаю старинное кресло с деревянной рамой и мягким сиденьем. Уникальный элемент интерьера.', 5000, 5, 5, '2023-12-24', 0, 2, '2023-12-24'),
('Учебники по программированию', 'Продаю учебники по программированию для начинающих и опытных разработчиков.', 1200, 1, 6, '2023-12-24', 0, 2, '2023-12-24'),
('Пылесос Samsung', 'Продаю мощный пылесос Samsung с множеством функций. Отличное решение для уборки дома.', 8000, 2, 7, '2023-12-24', 0, 2, '2023-12-24'),
('Ноутбук ASUS VivoBook', 'Продаю ноутбук ASUS VivoBook в отличном состоянии. Высокая производительность и стильный дизайн.', 25000, 3, 8, '2023-12-24', 0, 2, '2023-12-24'),
('Курсы по фотографии', 'Провожу курсы по фотографии для любителей и профессионалов. Откройте для себя мир фотографии.', 3000, 4, 9, '2023-12-24', 0, 2, '2023-12-24'),
('Продаю антикварный граммофон', 'Уникальный антикварный граммофон в отличном состоянии. Идеальное украшение для коллекции.', 10000, 5, 10, '2023-12-24', 0, 2, '2023-12-24'),
('Репетитор по физике', 'Провожу индивидуальные занятия по физике для школьников и студентов. Гарантированный успех.', 1800, 1, 11, '2023-12-24', 0, 2, '2023-12-24'),
('Микроволновка Whirlpool', 'Продаю микроволновую печь Whirlpool в отличном состоянии. Идеальное решение для быстрого приготовления пищи.', 6000, 2, 12, '2023-12-24', 0, 2, '2023-12-24'),
('Комплект учебных пособий по химии', 'Продаю комплект учебных пособий по химии для школьников и студентов. Весь курс в одном наборе.', 2500, 4, 13, '2023-12-24', 0, 2, '2023-12-24'),
('Холодильник Atlant', 'Продаю холодильник Atlant с морозильной камерой. В хорошем состоянии, все функции работают.', 9000, 2, 14, '2023-12-24', 0, 2, '2023-12-24'),
('Смарт-часы Apple Watch', 'Продаю смарт-часы Apple Watch Series 7. Новые, в упаковке. Отличный подарок.', 20000, 3, 15, '2023-12-24', 0, 2, '2023-12-24'),
('Репетитор по географии', 'Провожу занятия по географии для школьников и студентов. Интересные уроки и подготовка к экзаменам.', 1500, 4, 16, '2023-12-24', 0, 2, '2023-12-24'),
('Книги по истории России', 'Продаю книги по истории России от древних времен до современности. Увлекательное чтение.', 1200, 1, 17, '2023-12-24', 0, 2, '2023-12-24'),
('Миксер Braun', 'Продаю миксер Braun в отличном состоянии. Идеальное решение для приготовления вкусных десертов.', 4000, 2, 18, '2023-12-24', 0, 2, '2023-12-24'),
('Курсы по веб-разработке', 'Провожу курсы по веб-разработке для начинающих. От основ до создания собственного веб-проекта.', 3500, 3, 19, '2023-12-24', 0, 2, '2023-12-24'),
('Продаю старинный глобус', 'Уникальный старинный глобус с деревянной подставкой. Отличное дополнение к интерьеру.', 8000, 5, 20, '2023-12-24', 0, 2, '2023-12-24');

INSERT INTO "Advertisements" (header, description, price, category, author, "publicationDate", "countWatch", "status", "editDate") VALUES
('Новая коллекция учебных пособий', 'Предлагаю свежую коллекцию учебных пособий по различным предметам. Идеальное подспорье для обучения.', 1800, 1, 1, '2023-12-24', 0, 2, '2023-12-24'),
('Мясорубка Bosch', 'Продаю мясорубку Bosch в отличном состоянии. Идеальное решение для приготовления фарша и колбас.', 5000, 2, 2, '2023-12-24', 0, 2, '2023-12-24'),
('Наушники Sony WH-1000XM4', 'Продаю наушники Sony WH-1000XM4. Отличное качество звука и активное шумоподавление.', 15000, 3, 3, '2023-12-24', 0, 2, '2023-12-24'),
('Репетитор по итальянскому', 'Провожу занятия по итальянскому языку для начинающих и продвинутых. Учимся весело и эффективно.', 2200, 4, 4, '2023-12-24', 0, 2, '2023-12-24'),
('Продаю винтажный ковер', 'Продаю винтажный ковер в хорошем состоянии. Уникальный элемент декора для вашего интерьера.', 7000, 5, 5, '2023-12-24', 0, 2, '2023-12-24'),
('Книги по искусству', 'Продаю книги по искусству и художественной графике. Изучайте искусство вместе с профессионалами.', 1000, 4, 6, '2023-12-24', 0, 2, '2023-12-24'),
('Микроволновая печь Panasonic', 'Продаю микроволновую печь Panasonic в отличном состоянии. Отличный выбор для быстрого приготовления блюд.', 6500, 2, 7, '2023-12-24', 0, 2, '2023-12-24'),
('Ноутбук HP Pavilion', 'Продаю ноутбук HP Pavilion с мощными характеристиками. Идеальное решение для работы и развлечений.', 20000, 3, 8, '2023-12-24', 0, 2, '2023-12-24'),
('Фотокурс по архитектурной съемке', 'Продаю фотокурс по архитектурной съемке для фотографов. Создавайте удивительные снимки городского ландшафта.', 2500, 4, 9, '2023-12-24', 0, 2, '2023-12-24'),
('Старинная ваза', 'Продаю старинную вазу с узорами. Отличное дополнение для коллекционеров и любителей антиквариата.', 4000, 5, 10, '2023-12-24', 0, 2, '2023-12-24'),
('Репетитор по химии', 'Провожу занятия по химии для школьников и студентов. Индивидуальный подход и эффективные методики обучения.', 1700, 1, 11, '2023-12-24', 0, 2, '2023-12-24'),
('Пылесос Miele', 'Продаю пылесос Miele в идеальном состоянии. Мощный и эффективный инструмент для уборки.', 9000, 2, 12, '2023-12-24', 0, 2, '2023-12-24'),
('Продаю смартфон Samsung Galaxy S21', 'Новый смартфон Samsung Galaxy S21 в оригинальной упаковке. Отличный подарок.', 28000, 3, 13, '2023-12-24', 0, 2, '2023-12-24'),
('Комплект учебников по биологии', 'Продаю комплект учебников по биологии для школьников и студентов. Все необходимые материалы в одном наборе.', 2300, 4, 14, '2023-12-24', 0, 2, '2023-12-24'),
('Холодильник Haier', 'Продаю холодильник Haier с нижней морозильной камерой. Идеальное решение для семейного использования.', 8500, 2, 15, '2023-12-24', 0, 2, '2023-12-24'),
('Репетитор по испанскому', 'Провожу индивидуальные занятия по испанскому языку. Учимся весело и с пользой.', 2000, 4, 16, '2023-12-24', 0, 2, '2023-12-24'),
('Книги по философии', 'Продаю книги по философии различных авторов. Углубленное чтение для ценителей мудрых мыслей.', 1300, 1, 17, '2023-12-24', 0, 2, '2023-12-24'),
('Кофеварка Bosch', 'Продаю кофеварку Bosch в отличном состоянии. Идеальное решение для приготовления ароматного кофе.', 3500, 2, 18, '2023-12-24', 0, 2, '2023-12-24'),
('Курсы по мобильной разработке', 'Провожу курсы по мобильной разработке для начинающих. Создавайте свои мобильные приложения.', 4000, 3, 19, '2023-12-24', 0, 2, '2023-12-24'),
('Продаю старинный ковчег', 'Уникальный старинный ковчег с деревянной резьбой. Прекрасное украшение для дома.', 7500, 5, 20, '2023-12-24', 0, 2, '2023-12-24');


-- users

INSERT INTO "Users" (name, "regDate", type, "login", "password_hash") VALUES
('John Doe', '2023-12-15', 2, 'johnDoe', 1216985755),
('Alice Johnson', '2023-12-10', 2, 'aliceJ', 1216985755),
('Bob Smith', '2023-11-28', 2, 'bobS', 1216985755),
('Elena Petrova', '2023-11-20', 2, 'elenaP', 1216985755),
('Maxim Ivanov', '2023-11-12', 2, 'maxI', 1216985755),
('Olga Sidorova', '2023-11-05', 2, 'olgaS', 1216985755),
('Michael Brown', '2023-10-25', 2, 'michaelB', 1216985755),
('Anna Kozlova', '2023-10-18', 2, 'annaK', 1216985755),
('Daniel Lee', '2023-10-05', 2, 'danielL', 1216985755),
('Sophia Kim', '2023-09-28', 2, 'sophiaK', 1216985755);

INSERT INTO "Purchases" (ads, seller, buyer, price, "date") VALUES
(2, 5, 6, 5000, '2023-12-30'),
(1, 8, 1, 25000, '2023-12-30'),
(9, 2, 9, 15000, '2023-12-30'),
(7, 3, 10, 12000, '2023-12-30');

INSERT INTO "Bookings" (ads, claimant, "dateStart", "dateUntil") VALUES
(8, 3, '2023-12-26', '2024-01-15'),
(3, 4, '2023-12-27', '2023-12-31'),
(4, 10, '2023-12-28', '2024-01-10'),
(10, 6, '2023-12-29', '2024-01-05');

-- ads to admin
INSERT INTO "Advertisements" (header, description, price, category, author, "publicationDate", "countWatch", "status", "editDate") VALUES
('Массажные сеансы', 'Опытный массажист предоставит услуги классического и точечного массажа. Расслабьтесь и ощутите прилив энергии!', 3000, 2, 6, '2023-12-29', 0, 1, '2023-12-29'),
('Прокат велосипедов', 'Сдам в аренду велосипеды различных моделей. Идеально для прогулок по городу или по парку.', 800, 2, 8, '2023-12-30', 0, 1, '2023-12-30'),
('Садовый качели', 'Продаю уютные садовые качели для отдыха на свежем воздухе. Сделайте ваш сад еще комфортнее!', 2500, 3, 13, '2023-12-31', 0, 1, '2023-12-31'),
('Газонокосилка Bosch', 'Продаю надежную газонокосилку Bosch. Обеспечьте вашему газону ухоженный вид!', 6000, 1, 9, '2024-01-01', 0, 1, '2024-01-01'),
('Курсы английского языка', 'Преподаватель с опытом проведет индивидуальные или групповые занятия. Заговорите на английском с уверенностью!', 15000, 4, 14, '2024-01-02', 0, 1, '2024-01-02'),
('Настольная игра "Колонизаторы"', 'Продаю настольную игру для ценителей стратегии. Отличное развлечение для всей семьи!', 1000, 2, 15, '2024-01-03', 0, 1, '2024-01-03'),
('Тренажер для пресса', 'Продаю компактный тренажер для тренировки мышц пресса. Получите красивый рельеф без походов в спортзал!', 1200, 1, 16, '2024-01-04', 0, 1, '2024-01-04'),
('Подарочные сертификаты на массаж', 'Идеальный подарок для ваших близких! Подарите им релаксацию и заботу о здоровье.', 5000, 4, 17, '2024-01-05', 0, 1, '2024-01-05'),
('Продам раритетную книгу', 'Уникальное издание старинной книги. Идеальный подарок для коллекционера литературы.', 8000, 1, 18, '2024-01-06', 0, 1, '2024-01-06'),
('Семейный фотосет на природе', 'Пройдемся по красивым местам природы и создадим незабываемые семейные фотографии. Бронируйте свой фотосет!', 6000, 5, 19, '2024-01-07', 0, 1, '2024-01-07');

INSERT INTO "Advertisements" (header, description, price, category, author, "publicationDate", "countWatch", "status", "editDate") VALUES
('Фотокамера Canon EOS 5D Mark IV', 'Продаю профессиональную фотокамеру Canon EOS 5D Mark IV. Отличное состояние и высокое качество съемки.', 50000, 3, 1, '2023-12-24', 0, 1, '2023-12-24'),
('Продаю велосипед', 'Продаю городской велосипед в отличном состоянии. Удобное средство передвижения и занятий спортом.', 7000, 5, 2, '2023-12-24', 0, 1, '2023-12-24'),
('Ноутбук Dell Inspiron', 'Продаю ноутбук Dell Inspiron с большим экраном и высокой производительностью. Идеально подходит для работы и развлечений.', 18000, 2, 3, '2023-12-24', 0, 1, '2023-12-24'),
('Курсы по дизайну интерьера', 'Провожу курсы по дизайну интерьера. Развивайте свое творческое мышление и создавайте стильные интерьеры.', 2500, 4, 4, '2023-12-24', 0, 1, '2023-12-24'),
('Продаю старинную книгу', 'Продаю старинную книгу из личной коллекции. Уникальное издание для ценителей литературы.', 1200, 1, 5, '2023-12-24', 0, 1, '2023-12-24'),
('Компьютерный стол', 'Продаю компьютерный стол с подставкой для клавиатуры и выдвижными полками. Идеальное решение для рабочего места.', 3000, 2, 6, '2023-12-24', 0, 1, '2023-12-24'),
('Продаю столовую посуду', 'Продаю комплект столовой посуды. Идеальное решение для сервировки стола и приема гостей.', 800, 5, 7, '2023-12-24', 0, 1, '2023-12-24'),
('Смарт-телевизор LG', 'Продаю смарт-телевизор LG с большим экраном и высоким разрешением. Идеальный выбор для домашнего кинотеатра.', 22000, 3, 8, '2023-12-24', 0, 1, '2023-12-24'),
('Репетитор по русскому языку', 'Провожу занятия по русскому языку для школьников и студентов. Помощь в подготовке к экзаменам и контрольным.', 1500, 4, 9, '2023-12-24', 0, 1, '2023-12-24'),
('Продаю старинный настольный светильник', 'Уникальный настольный светильник в античном стиле. Прекрасное дополнение к интерьеру вашего дома.', 5000, 5, 10, '2023-12-24', 0, 1, '2023-12-24'),
('Репетитор по французскому', 'Провожу индивидуальные занятия по французскому языку. Обучение в игровой форме и разнообразные методики.', 2000, 1, 11, '2023-12-24', 0, 1, '2023-12-24'),
('Микроволновая печь LG', 'Продаю микроволновую печь LG в идеальном состоянии. Идеальное решение для быстрого приготовления пищи.', 6000, 2, 12, '2023-12-24', 0, 1, '2023-12-24'),
('Продаю кровать', 'Продаю двуспальную кровать с ортопедическим матрасом. Комфортный отдых и качественный сон гарантированы.', 12000, 5, 13, '2023-12-24', 0, 1, '2023-12-24'),
('Наушники Beats Studio 3', 'Продаю наушники Beats Studio 3. Качественный звук и стильный дизайн для истинных меломанов.', 18000, 3, 14, '2023-12-24', 0, 1, '2023-12-24'),
('Репетитор по истории', 'Провожу занятия по истории для школьников и студентов. Помощь в подготовке к учебе и экзаменам.', 1700, 4, 15, '2023-12-24', 0, 1, '2023-12-24'),
('Коллекция комиксов Marvel', 'Продаю коллекцию комиксов Marvel. Увлекательные истории с любимыми супергероями.', 2500, 1, 16, '2023-12-24', 0, 1, '2023-12-24'),
('Пылесос Dyson', 'Продаю пылесос Dyson с технологией циклонного всасывания. Идеальное решение для чистоты в вашем доме.', 10000, 2, 17, '2023-12-24', 0, 1, '2023-12-24'),
('Репетитор по географии', 'Провожу индивидуальные занятия по географии. Учимся картам и изучаем интересные факты о мире.', 2000, 4, 18, '2023-12-24', 0, 1, '2023-12-24'),
('Продаю винтажный диван', 'Продаю винтажный диван с мягкой обивкой. Стильное решение для вашего уюта и комфорта.', 9000, 5, 19, '2023-12-24', 0, 1, '2023-12-24'),
('Курсы по программированию на Python', 'Провожу курсы по программированию на языке Python. Начните свой путь в мир IT с нуля.', 3000, 3, 20, '2023-12-24', 0, 1, '2023-12-24');

